RudolphRiedel/FT800-FT813/examples/EVE_Test_SAME51_EVE3-43G/EmbeddedVideoEngine/EVE_target.c
/*
@file    EVE_target.c
@brief   target specific functions for plain C targets
@version 5.0
@date    2025-08-30
@author  Rudolph Riedel

@section LICENSE

MIT License

Copyright (c) 2016-2025 Rudolph Riedel

Permission is hereby granted, free of charge, to any person obtaining a copy of
this software and associated documentation files (the "Software"), to deal in
the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense,
and/or sell copies of the Software, and to permit persons to whom the Software
is furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

@section History

5.0
- changed the DMA buffer from uin8_t to uint32_t
- added a section for Arduino-ESP32
- corrected the clock-divider settings for ESP32
- added DMA to ARDUINO_METRO_M4 target
- added DMA to ARDUINO_NUCLEO_F446RE target
- added DMA to Arduino-ESP32 target
- added a native ESP32 target with DMA
- added an ARDUINO_TEENSY41 target with DMA support
- added DMA for the Raspberry Pi Pico - RP2040
- added ARDUINO_TEENSY35 to the ARDUINO_TEENSY41 target
- transferred the little experimental STM32 code I had over from my experimental branch
- added S32K144 support including DMA
- split up this file in EVE_target.c for the plain C targets and EVE_target.cpp for the Arduino C++ targets
- converted all TABs to SPACEs
- split the ATSAMC21 and ATSAMx51 targets into separate sections
- added more defines for ATSAMC21 and ATSAMx51 - chip crises...
- added DMA support for the GD32C103 target
- fixed the ESP32 target to work with the ESP32-S3 as well
- basic maintenance: checked for violations of white space and indent rules
- changed the code for ATSAMC21 and ATSAMx51 targets to use EVE_SPI_SERCOM
- ESP32: fix for building with ESP-IDF 5.x
- ESP32: changed a couple of {0} to {}
- ESP32: changed back a couple of {} to {0} as C and C++ are not the same thing...
- Bugfix issue #89: ESP32 not initializing if GPIO pin number > 31
- moved the include for EVE_target.h to avoid the empty translation unit warning
 from -Wpedantic when building for Arduino
- added STM32WB55xx to the STM32 target
- reworked STM32 support, DMA is working for at least the F407, DMA for the H7 is still WIP
- Bugfix: #136 thanks to Jwf68 on Github, EVE_PDN_PORT_NUM -> EVE_PD_PORT_NUM
- Bugfix: STM32F103 does not use gpio_init.Alternate for HAL_GPIO_Init()

 */

#include "EVE_target.h"

#if !defined (ARDUINO)

#include "EVE_commands.h"

#if defined (__GNUC__)

/* ################################################################## */
/* ################################################################## */

#if defined (__SAMC21E18A__) \
    || defined (__SAMC21J18A__) \
    || defined (__SAMC21J17A__) \
    || defined (__SAMC21J16A__)
/* note: target as set by AtmelStudio, valid  are all from the same family */

void DELAY_MS(uint16_t val)
{
    while (val > 0U)
    {
        for (uint16_t counter = 0; counter < EVE_DELAY_1MS; counter++)
        {
            __asm__ volatile ("nop");
        }
        val--;
    }
}

#if defined (EVE_DMA)

static DmacDescriptor dmadescriptor __attribute__((aligned(16)));
static DmacDescriptor dmawriteback __attribute__((aligned(16)));
uint32_t EVE_dma_buffer[1025U];
volatile uint16_t EVE_dma_buffer_index;
volatile uint8_t EVE_dma_busy = 0;

void EVE_init_dma(void)
{
    DMAC->CTRL.reg = 0;
    while (DMAC->CTRL.bit.DMAENABLE);
    DMAC->CTRL.bit.SWRST = 1;
    while (DMAC->CTRL.bit.SWRST); /* wait for the software-reset to be complete */

    DMAC->BASEADDR.reg = (uint32_t) &dmadescriptor;
    DMAC->WRBADDR.reg = (uint32_t) &dmawriteback;

    DMAC->CHCTRLB.reg = DMAC_CHCTRLB_TRIGACT_BEAT | DMAC_CHCTRLB_TRIGSRC(EVE_SPI_DMA_TRIGGER); /* beat-transfer, SERCOM0 TX Trigger, level 0, channel-event input / output disabled */
    DMAC->CHID.reg = EVE_DMA_CHANNEL; /* select channel */
    DMAC->CTRL.reg = DMAC_CTRL_LVLEN0 | DMAC_CTRL_DMAENABLE; /* enable level 0 transfers, enable DMA */

    dmadescriptor.BTCTRL.reg = DMAC_BTCTRL_SRCINC | DMAC_BTCTRL_VALID; /* increase source-address, beat-size = 8-bit */
    dmadescriptor.DSTADDR.reg = (uint32_t) &EVE_SPI_SERCOM->SPI.DATA.reg;
    dmadescriptor.DESCADDR.reg = 0; /* no next descriptor */

    DMAC->CHINTENSET.reg = DMAC_CHINTENSET_TCMPL;
    NVIC_SetPriority(DMAC_IRQn, 0);
    NVIC_EnableIRQ(DMAC_IRQn);
}

void EVE_start_dma_transfer(void)
{
    dmadescriptor.BTCNT.reg = (EVE_dma_buffer_index * 4U) - 1U;
    dmadescriptor.SRCADDR.reg = (uint32_t) &EVE_dma_buffer[EVE_dma_buffer_index]; /* note: last entry in array + 1 */
    EVE_SPI_SERCOM->SPI.CTRLB.bit.RXEN = 0; /* switch receiver off by setting RXEN to 0 which is not enable-protected */
    EVE_cs_set();
    DMAC->CHCTRLA.bit.ENABLE = 1; /* start sending out EVE_dma_buffer ?*/
    EVE_dma_busy = 42;
}

/* executed at the end of the DMA transfer */
void DMAC_Handler()
{
    DMAC->CHID.reg = EVE_DMA_CHANNEL; /* we only use one channel, so this should not even change */
    DMAC->CHINTFLAG.reg = DMAC_CHINTFLAG_TCMPL; /* ack irq */
    while (0U == EVE_SPI_SERCOM->SPI.INTFLAG.bit.TXC); /* wait for the SPI to be done transmitting */
    EVE_SPI_SERCOM->SPI.CTRLB.bit.RXEN = 1; /* switch receiver on by setting RXEN to 1 which is not enable protected */
    EVE_cs_clear();
    EVE_dma_busy = 0;
}

#endif /* DMA */
#endif /* ATSAMC21 */

/* ################################################################## */
/* ################################################################## */

#if defined (__SAME51J19A__) \
    || defined (__SAME51J18A__) \
    || defined (__SAMD51P20A__) \
    || defined (__SAMD51J19A__) \
    || defined (__SAMD51G18A__)
/* note: target as set by AtmelStudio, valid  are all from the same family */

void DELAY_MS(uint16_t val)
{
    while (val > 0U)
    {
        for (uint16_t counter = 0; counter < EVE_DELAY_1MS; counter++)
        {
            __asm__ volatile ("nop");
        }
        val--;
    }
}

#if defined (EVE_DMA)

static DmacDescriptor dmadescriptor __attribute__((aligned(16)));
static DmacDescriptor dmawriteback __attribute__((aligned(16)));
uint32_t EVE_dma_buffer[1025U];
volatile uint16_t EVE_dma_buffer_index;
volatile uint8_t EVE_dma_busy = 0;

void EVE_init_dma(void)
{
    DMAC->CTRL.reg = 0;
    while (DMAC->CTRL.bit.DMAENABLE);
    DMAC->CTRL.bit.SWRST = 1;
    while (DMAC->CTRL.bit.SWRST); /* wait for the software-reset to be complete */

    DMAC->BASEADDR.reg = (uint32_t) &dmadescriptor;
    DMAC->WRBADDR.reg = (uint32_t) &dmawriteback;
    DMAC->CTRL.reg = DMAC_CTRL_LVLEN0 | DMAC_CTRL_DMAENABLE; /* enable level 0 transfers, enable DMA */
    DMAC->Channel[EVE_DMA_CHANNEL].CHCTRLA.reg =
        DMAC_CHCTRLA_BURSTLEN_SINGLE |
        DMAC_CHCTRLA_TRIGACT_BURST |
        DMAC_CHCTRLA_TRIGSRC(EVE_SPI_DMA_TRIGGER);

    dmadescriptor.BTCTRL.reg = DMAC_BTCTRL_SRCINC | DMAC_BTCTRL_VALID; /* increase source-address, beat-size = 8-bit */
    dmadescriptor.DSTADDR.reg = (uint32_t) &EVE_SPI_SERCOM->SPI.DATA.reg;
    dmadescriptor.DESCADDR.reg = 0; /* no next descriptor */

    DMAC->Channel[EVE_DMA_CHANNEL].CHINTENSET.bit.TCMPL = 1; /* enable transfer complete interrupt */
    DMAC->CTRL.reg = DMAC_CTRL_LVLEN0 | DMAC_CTRL_DMAENABLE; /* enable level 0 transfers, enable DMA */

    NVIC_SetPriority(DMAC_0_IRQn, 0);
    NVIC_EnableIRQ(DMAC_0_IRQn);
}

void EVE_start_dma_transfer(void)
{
    dmadescriptor.BTCNT.reg = (EVE_dma_buffer_index * 4U) - 1U;
    dmadescriptor.SRCADDR.reg = (uint32_t) &EVE_dma_buffer[EVE_dma_buffer_index]; /* note: last entry in array + 1 */
    EVE_SPI_SERCOM->SPI.CTRLB.bit.RXEN = 0; /* switch receiver off by setting RXEN to 0 which is not enable-protected */
    EVE_cs_set();
    DMAC->Channel[EVE_DMA_CHANNEL].CHCTRLA.bit.ENABLE = 1; /* start sending out EVE_dma_buffer */
    EVE_dma_busy = 42;
}

/* executed at the end of the DMA transfer */
void DMAC_0_Handler()
{
    DMAC->Channel[EVE_DMA_CHANNEL].CHINTFLAG.reg = DMAC_CHINTFLAG_TCMPL; /* ack irq */
    while (0U == EVE_SPI_SERCOM->SPI.INTFLAG.bit.TXC); /* wait for the SPI to be done transmitting */
    EVE_SPI_SERCOM->SPI.CTRLB.bit.RXEN = 1; /* switch receiver on by setting RXEN to 1 which is not enable protected */
    EVE_dma_busy = 0;
    EVE_cs_clear();
}

#endif /* DMA */
#endif /* ATSAMx51 */

/* ################################################################## */
/* ################################################################## */

/* set with "build_flags" in platformio.ini or as defines in your build environment */
#if defined (STM32L0) \
    || defined (STM32F0) \
    || defined (STM32F1) \
    || defined (STM32F3) \
    || defined (STM32F4) \
    || defined (STM32G4) \
    || defined (STM32G0) \
    || defined (STM32WB55xx)

#include "EVE_target.h"
#include "EVE_commands.h"

SPI_HandleTypeDef eve_spi_handle = {0};

void EVE_init_spi(void)
{

#if (EVE_CS_PORT_NUM == 1U) || (EVE_PD_PORT_NUM == 1U) || (EVE_SPI_PORT_NUM == 1U)
    __HAL_RCC_GPIOA_CLK_ENABLE();
#endif

