RudolphRiedel/FT800-FT813/examples/EVE_Test_SAME51_EVE3-43G/EmbeddedVideoEngine/EVE_target.c
#if (EVE_CS_PORT_NUM == 2U) || (EVE_PD_PORT_NUM == 2U) || (EVE_SPI_PORT_NUM == 2U)
    __HAL_RCC_GPIOB_CLK_ENABLE();
#endif

#if (EVE_CS_PORT_NUM == 3U) || (EVE_PD_PORT_NUM == 3U) || (EVE_SPI_PORT_NUM == 3U)
    __HAL_RCC_GPIOC_CLK_ENABLE();
#endif

#if (EVE_CS_PORT_NUM == 4U) || (EVE_PD_PORT_NUM == 4U) || (EVE_SPI_PORT_NUM == 4U)
    __HAL_RCC_GPIOD_CLK_ENABLE();
#endif

#if (EVE_CS_PORT_NUM == 5U) || (EVE_PD_PORT_NUM == 5U) || (EVE_SPI_PORT_NUM == 5U)
    __HAL_RCC_GPIOE_CLK_ENABLE();
#endif

#if (EVE_CS_PORT_NUM == 6U) || (EVE_PD_PORT_NUM == 6U) || (EVE_SPI_PORT_NUM == 6U)
    __HAL_RCC_GPIOF_CLK_ENABLE();
#endif

#if (EVE_CS_PORT_NUM == 7U) || (EVE_PD_PORT_NUM == 7U) || (EVE_SPI_PORT_NUM == 7U)
    __HAL_RCC_GPIOG_CLK_ENABLE();
#endif

#if (EVE_CS_PORT_NUM == 8U) || (EVE_PD_PORT_NUM == 8U) || (EVE_SPI_PORT_NUM == 8U)
    __HAL_RCC_GPIOH_CLK_ENABLE();
#endif

#if (EVE_CS_PORT_NUM == 9U) || (EVE_PD_PORT_NUM == 9U) || (EVE_SPI_PORT_NUM == 9U)
    __HAL_RCC_GPIOI_CLK_ENABLE();
#endif

    GPIO_InitTypeDef gpio_init = {0};

    gpio_init.Pin = EVE_CS;
    gpio_init.Mode = GPIO_MODE_OUTPUT_PP;
    gpio_init.Pull = GPIO_NOPULL;
    gpio_init.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(EVE_CS_PORT, &gpio_init);

    HAL_GPIO_WritePin(EVE_CS_PORT, EVE_CS, GPIO_PIN_SET);

    gpio_init.Pin = EVE_PD;
    gpio_init.Mode = GPIO_MODE_OUTPUT_PP;
    gpio_init.Pull = GPIO_NOPULL;
    gpio_init.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(EVE_PD_PORT, &gpio_init);

    HAL_GPIO_WritePin(EVE_PD_PORT, EVE_PD, GPIO_PIN_RESET);

    /* SPIx GPIO Configuration: */
#if (EVE_SPI_NUM == 1U)
    __HAL_RCC_SPI1_CLK_ENABLE();
#elif (EVE_SPI_NUM == 2U)
    __HAL_RCC_SPI2_CLK_ENABLE();
#elif (EVE_SPI_NUM == 3U)
    __HAL_RCC_SPI3_CLK_ENABLE();
#elif (EVE_SPI_NUM == 4U)
    __HAL_RCC_SPI4_CLK_ENABLE();
#elif (EVE_SPI_NUM == 5U)
    __HAL_RCC_SPI5_CLK_ENABLE();
#elif (EVE_SPI_NUM == 6U)
    __HAL_RCC_SPI6_CLK_ENABLE();
#endif

    gpio_init.Pin = EVE_SCK|EVE_MOSI|EVE_MISO;
    gpio_init.Mode = GPIO_MODE_AF_PP;
    gpio_init.Pull = GPIO_NOPULL;
    gpio_init.Speed = GPIO_SPEED_FREQ_HIGH;
    gpio_init.Alternate = EVE_SPI_GPIO_ALT_FUNCTION; /* check reference manual! */
    HAL_GPIO_Init(EVE_SPI_PORT, &gpio_init);

    eve_spi_handle.Instance = EVE_SPI;
    eve_spi_handle.Init.Mode = SPI_MODE_MASTER;
    eve_spi_handle.Init.Direction = SPI_DIRECTION_2LINES_TXONLY;
    eve_spi_handle.Init.DataSize = SPI_DATASIZE_8BIT;
    eve_spi_handle.Init.CLKPolarity = SPI_POLARITY_LOW;
    eve_spi_handle.Init.CLKPhase = SPI_PHASE_1EDGE;
    eve_spi_handle.Init.NSS = SPI_NSS_SOFT;
    eve_spi_handle.Init.BaudRatePrescaler = EVE_SPI_PRESCALER;
    eve_spi_handle.Init.FirstBit = SPI_FIRSTBIT_MSB;

    HAL_SPI_Init(&eve_spi_handle);

    __HAL_SPI_ENABLE(&eve_spi_handle);
    LL_SPI_StartMasterTransfer(EVE_SPI);
}

#if defined (EVE_DMA)

volatile uint32_t EVE_dma_buffer[1025U] __attribute__((aligned(32)));
volatile uint16_t EVE_dma_buffer_index;
volatile uint8_t EVE_dma_busy = 0;

DMA_HandleTypeDef eve_dma_handle = {0};
DMA_HandleTypeDef eve_dma_handle_rx = {0};

#if 1
/* Callback for end-of-DMA-transfer, needs USE_HAL_SPI_REGISTER_CALLBACKS to be set to 1 */
void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi)
{
    if (hspi == &eve_spi_handle)
    {
        EVE_dma_busy = 0;
        EVE_cs_clear();
        //LL_SPI_StartMasterTransfer(EVE_SPI);
    }
}
#endif

void EVE_init_dma(void)
{
#if (EVE_DMA_UNIT_NUM == 1U)
    __HAL_RCC_DMA1_CLK_ENABLE();
#elif (EVE_DMA_UNIT_NUM == 2U)
    __HAL_RCC_DMA2_CLK_ENABLE();
#endif

    eve_dma_handle.Instance = EVE_DMA_INSTANCE;
    eve_dma_handle.Init.Request = EVE_DMA_REQUEST;
    eve_dma_handle.Init.Direction = DMA_MEMORY_TO_PERIPH;
    eve_dma_handle.Init.PeriphInc = DMA_PINC_DISABLE;
    eve_dma_handle.Init.MemInc = DMA_MINC_ENABLE;
    eve_dma_handle.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    eve_dma_handle.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    eve_dma_handle.Init.Mode = DMA_NORMAL;
    eve_dma_handle.Init.Priority = DMA_PRIORITY_LOW;
    eve_dma_handle.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
    HAL_DMA_Init(&eve_dma_handle);
    __HAL_LINKDMA(&eve_spi_handle, hdmatx, eve_dma_handle);

    HAL_SPI_RegisterCallback(&eve_spi_handle, HAL_SPI_TX_COMPLETE_CB_ID, &HAL_SPI_TxCpltCallback);

    HAL_NVIC_SetPriority(EVE_DMA_IRQ, 0, 0);
    HAL_NVIC_EnableIRQ(EVE_DMA_IRQ);
}

//uint8_t TestBuffer[20]={0,1,2,3,4,5,6,7,8,9,11,12,13,14,15,16,17,18,19}; // test!

void EVE_start_dma_transfer(void)
{
    LL_SPI_Disable(EVE_SPI);
    while (LL_SPI_IsEnabled(EVE_SPI)) {}
    //LL_SPI_SetTransferDirection(EVE_SPI, SPI_DIRECTION_2LINES_TXONLY);
    //LL_SPI_SuspendMasterTransfer(EVE_SPI);
    LL_SPI_Enable(EVE_SPI);

    EVE_cs_set();
    if (HAL_OK == HAL_SPI_Transmit_DMA(&eve_spi_handle, ((uint8_t *) &EVE_dma_buffer[0]) + 1U, ((EVE_dma_buffer_index)* 4U) - 1U))
    //if (HAL_OK == HAL_SPI_Transmit_DMA(&eve_spi_handle, TestBuffer, 12))
    {
        EVE_dma_busy = 42;
    }
}

/* DMA-done-Interrupt-Handler */
#if EVE_DMA_UNIT_NUM == 1U
    #if EVE_DMA_STREAM_NUM == 0U
        void DMA1_Stream0_IRQHandler(void)
    #elif EVE_DMA_STREAM_NUM == 1U
        void DMA1_Stream1_IRQHandler(void)
    #elif EVE_DMA_STREAM_NUM == 2U
        void DMA1_Stream2_IRQHandler(void)
    #elif EVE_DMA_STREAM_NUM == 3U
        void DMA1_Stream3_IRQHandler(void)
    #elif EVE_DMA_STREAM_NUM == 4U
        void DMA1_Stream4_IRQHandler(void)
    #elif EVE_DMA_STREAM_NUM == 5U
        void DMA1_Stream5_IRQHandler(void)
    #elif EVE_DMA_STREAM_NUM == 6U
        void DMA1_Stream6_IRQHandler(void)
    #elif EVE_DMA_STREAM_NUM == 7U
        void DMA1_Stream7_IRQHandler(void)
    #endif
#elif EVE_DMA_UNIT_NUM == 2U
    #if EVE_DMA_STREAM_NUM == 0U
        void DMA2_Stream0_IRQHandler(void)
    #elif EVE_DMA_STREAM_NUM == 1U
        void DMA2_Stream1_IRQHandler(void)
    #elif EVE_DMA_STREAM_NUM == 2U
        void DMA2_Stream2_IRQHandler(void)
    #elif EVE_DMA_STREAM_NUM == 3U
        void DMA2_Stream3_IRQHandler(void)
    #elif EVE_DMA_STREAM_NUM == 4U
        void DMA2_Stream4_IRQHandler(void)
    #elif EVE_DMA_STREAM_NUM == 5U
        void DMA2_Stream5_IRQHandler(void)
    #elif EVE_DMA_STREAM_NUM == 6U
        void DMA2_Stream6_IRQHandler(void)
    #elif EVE_DMA_STREAM_NUM == 7U
        void DMA2_Stream7_IRQHandler(void)
    #endif
#endif
{
    HAL_DMA_IRQHandler(&eve_dma_handle);
}

