RudolphRiedel/FT800-FT813/examples/EVE_Test_SAME51_EVE3-43G/EmbeddedVideoEngine/EVE_target.c
#if 0
/* SPI EOT interrupt handler */
void SPI4_IRQHandler(void)
{
    HAL_SPI_IRQHandler(&eve_spi_handle);
}
#endif

#endif /* DMA */
#endif /* STM32 */

/* ################################################################## */
/* ################################################################## */

#if defined (ESP_PLATFORM) /* ESP32 */

#include "EVE_target.h"

void DELAY_MS(uint16_t ms)
{
    TickType_t ticksMS = pdMS_TO_TICKS(ms);
    if (ticksMS < 2U) ticksMS = 2;
    vTaskDelay(ticksMS);
}

spi_device_handle_t EVE_spi_device = {0};
spi_device_handle_t EVE_spi_device_simple = {0};

static void eve_spi_post_transfer_callback(void)
{
    gpio_set_level(EVE_CS, 1); /* tell EVE to stop listen */
#if defined (EVE_DMA)
        EVE_dma_busy = 0;
#endif
}

void EVE_init_spi(void)
{
    spi_bus_config_t buscfg = {0};
    spi_device_interface_config_t devcfg = {0};
    gpio_config_t io_cfg = {0};

#if ESP_IDF_VERSION_MAJOR <= 4
    io_cfg.intr_type = GPIO_PIN_INTR_DISABLE;
#elif ESP_IDF_VERSION_MAJOR == 5
    io_cfg.intr_type = GPIO_INTR_DISABLE;
#endif
    io_cfg.mode = GPIO_MODE_OUTPUT;
    io_cfg.pin_bit_mask = BIT64(EVE_PDN) | BIT64(EVE_CS);
    gpio_config(&io_cfg);

    gpio_set_level(EVE_CS, 1);
    gpio_set_level(EVE_PDN, 0);

    buscfg.mosi_io_num = EVE_MOSI;
    buscfg.miso_io_num = EVE_MISO;
    buscfg.sclk_io_num = EVE_SCK;
    buscfg.quadwp_io_num = -1;
    buscfg.quadhd_io_num = -1;
    buscfg.max_transfer_sz= 4088;

    devcfg.clock_speed_hz = 16U * 1000U * 1000U; /* clock = 16 MHz */
    devcfg.mode = 0;                          /* SPI mode 0 */
    devcfg.spics_io_num = -1;                 /* CS pin operated by app */
    devcfg.queue_size = 3;                    /* we need only one transaction in the que */
    devcfg.address_bits = 24;                 /* 24 bits for the address */
    devcfg.command_bits = 0;                  /* command operated by app */
    devcfg.post_cb = (transaction_cb_t)eve_spi_post_transfer_callback;

    spi_bus_initialize(SPI2_HOST, &buscfg, SPI_DMA_CH_AUTO);
    spi_bus_add_device(SPI2_HOST, &devcfg, &EVE_spi_device);

    devcfg.address_bits = 0;
    devcfg.post_cb = 0;
    devcfg.clock_speed_hz = 10U * 1000U * 1000U; /* clock = 10 MHz */
    spi_bus_add_device(SPI2_HOST, &devcfg, &EVE_spi_device_simple);
}

#if defined (EVE_DMA)

uint32_t EVE_dma_buffer[1025U];
volatile uint16_t EVE_dma_buffer_index;
volatile uint8_t EVE_dma_busy = 0;

void EVE_init_dma(void)
{
}

void EVE_start_dma_transfer(void)
{
    spi_transaction_t EVE_spi_transaction = {0};
    gpio_set_level(EVE_CS, 0); /* make EVE listen */
    EVE_spi_transaction.tx_buffer = (uint8_t *) &EVE_dma_buffer[1];
    EVE_spi_transaction.length = (EVE_dma_buffer_index-1) * 4U * 8U;
    EVE_spi_transaction.addr = 0x00b02578UL; /* WRITE + REG_CMDB_WRITE; */
    spi_device_queue_trans(EVE_spi_device, &EVE_spi_transaction, portMAX_DELAY);
    EVE_dma_busy = 42;
}

#endif /* DMA */
#endif /* ESP32 */

/* ################################################################## */
/* ################################################################## */

#if defined (RP2040)
/* note: set in platformio.ini by "build_flags = -D RP2040" */

void EVE_init_spi(void)
{
    // chip select is active-low -> initialized to high
    gpio_init(EVE_CS);
    gpio_set_dir(EVE_CS, GPIO_OUT);
    gpio_put(EVE_CS, 1);

    // power-down is active-low -> initialized to low
    gpio_init(EVE_PDN);
    gpio_set_dir(EVE_PDN, GPIO_OUT);
    gpio_put(EVE_PDN, 0);

    spi_init(EVE_SPI, 8000000U);
    gpio_set_function(EVE_MISO, GPIO_FUNC_SPI);
    gpio_set_function(EVE_SCK, GPIO_FUNC_SPI);
    gpio_set_function(EVE_MOSI, GPIO_FUNC_SPI);
}

#if defined (EVE_DMA)

#include "hardware/dma.h"
#include "hardware/irq.h"

uint32_t EVE_dma_buffer[1025U];
volatile uint16_t EVE_dma_buffer_index;
volatile uint8_t EVE_dma_busy = 0;
int dma_tx;
dma_channel_config dma_tx_config;

static void EVE_DMA_handler(void)
{
    dma_hw->ints0 = 1U << dma_tx; /* ack irq */
    while ((spi_get_hw(EVE_SPI)->sr & SPI_SSPSR_BSY_BITS) != 0U); /* wait for the SPI to be done transmitting */
    EVE_dma_busy = 0;
    EVE_cs_clear();
}

void EVE_init_dma(void)
{
    dma_tx = dma_claim_unused_channel(true);
    dma_tx_config = dma_channel_get_default_config(dma_tx);
    channel_config_set_transfer_data_size(&dma_tx_config, DMA_SIZE_8);
    channel_config_set_dreq(&dma_tx_config, spi_get_index(EVE_SPI) ? DREQ_SPI1_TX : DREQ_SPI0_TX);
    dma_channel_set_irq0_enabled (dma_tx, true);
    irq_set_exclusive_handler(DMA_IRQ_0, EVE_DMA_handler);
    irq_set_enabled(DMA_IRQ_0, true);
}

void EVE_start_dma_transfer(void)
{
    EVE_cs_set();
    dma_channel_configure(dma_tx, &dma_tx_config,
        &spi_get_hw(EVE_SPI)->dr, // write address
        ((uint8_t *) &EVE_dma_buffer[0]) + 1U, // read address
        (((EVE_dma_buffer_index) * 4U) - 1U), // element count (each element is of size transfer_data_size)
        true); // start transfer
    EVE_dma_busy = 42;
}
#endif /* DMA */

#endif /* RP2040 */

/* ################################################################## */
/* ################################################################## */

#if defined (CPU_S32K148) || defined (CPU_S32K144HFT0VLLT)

void DELAY_MS(uint16_t val)
{
    while (val > 0U)
    {
        for (uint16_t counter = 0; counter < EVE_DELAY_1MS; counter++)
        {
            __asm__ volatile ("nop");
        }
        val--;
    }
}

void EVE_init_spi(void)
{
    /* configure clock for LPSPI instance selected in EVE_target.h */
    PCC->PCCn[EVE_SPI_INDEX] &= ~PCC_PCCn_CGC_MASK;     /* disable clock */
    PCC->PCCn[EVE_SPI_INDEX] &= ~PCC_PCCn_PCS_MASK;     /* clear PCS field */
    PCC->PCCn[EVE_SPI_INDEX] |= PCC_PCCn_PCS(6);        /* PCS = 6 SPLLDIV2_CLK is selected */
    PCC->PCCn[EVE_SPI_INDEX] |= PCC_PCCn_CGC_MASK;      /* enable clock for LPSPIx */

    /* configure LPSPI instance selected in EVE_target.h */
    EVE_SPI->CR = LPSPI_CR_RST_MASK; /* software reset */
    EVE_SPI->CR = 0x00000000; /* disable module for configuration */
    EVE_SPI->CFGR1 = LPSPI_CFGR1_MASTER_MASK; /* master, mode 0 */
    EVE_SPI->TCR = LPSPI_TCR_PRESCALE(0) | LPSPI_TCR_FRAMESZ(7); /* divide peripheral clock by 4, frame size is 8bit */
    EVE_SPI->CCR = LPSPI_CCR_SCKDIV(4); /* SCK cycle is 4+2 = 6 cycles of the peripheral clock */
    EVE_SPI->FCR = 0; /* RXWATER=0: Rx flags set when Rx FIFO >0, TXWATER=0: Tx flags set when Tx FIFO < 1 */
    EVE_SPI->DER = 0x01; /* DMA TX request enabled */
    EVE_SPI->CR |= LPSPI_CR_MEN_MASK; /* MEN = 1 Module is enabled */
}

#if defined (EVE_DMA)

uint32_t EVE_dma_buffer[1025U];
volatile uint16_t EVE_dma_buffer_index;
volatile uint8_t EVE_dma_busy = 0;

void EVE_init_dma(void)
{
    PCC->PCCn[PCC_DMAMUX_INDEX] |= PCC_PCCn_CGC_MASK; /* DMAMUX */
    DMAMUX->CHCFG[EVE_DMA_CHANNEL] = 0;
    DMAMUX->CHCFG[EVE_DMA_CHANNEL] |= DMAMUX_CHCFG_SOURCE(EVE_DMAMUX_CHCFG_SOURCE);
    DMAMUX->CHCFG[EVE_DMA_CHANNEL] |= DMAMUX_CHCFG_ENBL_MASK;

    S32_NVIC->ISER[(uint32_t)(EVE_DMA_IRQ) >> 5U] = (uint32_t)(1UL << ((uint32_t)(EVE_DMA_IRQ) & (uint32_t)0x1FU)); /* enable DMA IRQ */

    DMA->TCD[EVE_DMA_CHANNEL].CSR = DMA_TCD_CSR_DREQ(1) | DMA_TCD_CSR_INTMAJOR(1); /* automatically clear ERQ bit after one major loop, irq when done */
    DMA->TCD[EVE_DMA_CHANNEL].SOFF = DMA_TCD_SOFF_SOFF(1); /* add 1 after each transfer */
    DMA->TCD[EVE_DMA_CHANNEL].ATTR = 0; /* 8-bit source and destination transfer size */
    DMA->TCD[EVE_DMA_CHANNEL].SLAST = 0;
    DMA->TCD[EVE_DMA_CHANNEL].DADDR = DMA_TCD_DADDR_DADDR((uint32_t) &EVE_SPI->TDR);
    DMA->TCD[EVE_DMA_CHANNEL].DOFF = 0; /* do not increase address after each transfer */
    DMA->TCD[EVE_DMA_CHANNEL].DLASTSGA = 0;
    DMA->TCD[EVE_DMA_CHANNEL].NBYTES.MLNO = DMA_TCD_NBYTES_MLNO_NBYTES(1); /* transfer 1 byte per minor loop */
}

void EVE_start_dma_transfer(void)
{
    uint8_t *bytes = ((uint8_t *) &EVE_dma_buffer[0]) + 1U;
    uint16_t length = (EVE_dma_buffer_index - 1U) * 4U;

    EVE_SPI->TCR |= LPSPI_TCR_RXMSK_MASK; /* disable LPSPI receive */
    EVE_cs_set();

    /* the first three bytes start from an unaligned address so these are send directly */
    for (uint8_t index = 0; index < 3U; index++)
    {
        EVE_SPI->SR |= LPSPI_SR_TDF_MASK; /* clear transmit data flag */
        EVE_SPI->TDR = bytes[index]; /* transmit data */
        while (0U == (EVE_SPI->SR & LPSPI_SR_TDF_MASK));
    }

