RudolphRiedel/FT800-FT813/examples/EVE_Test_SAME51_EVE3-43G/EmbeddedVideoEngine/EVE_target.c
    DMA->TCD[EVE_DMA_CHANNEL].SADDR = DMA_TCD_SADDR_SADDR((uint32_t) ((&EVE_dma_buffer[1])));
    DMA->TCD[EVE_DMA_CHANNEL].CITER.ELINKNO = DMA_TCD_CITER_ELINKNO_CITER(length) | DMA_TCD_CITER_ELINKNO_ELINK(0);
    DMA->TCD[EVE_DMA_CHANNEL].BITER.ELINKNO = DMA_TCD_BITER_ELINKNO_BITER(length) | DMA_TCD_BITER_ELINKNO_ELINK(0);
    DMA->SERQ = EVE_DMA_CHANNEL; /* start DMA */
    EVE_dma_busy = 42;
}

void EVE_DMA_IRQHandler(void)
{
    /* the end of the DMA major loop */
    DMA->CINT = DMA_CINT_CINT(EVE_DMA_CHANNEL); /* clear the flag */
    while (0U == (EVE_SPI->SR & LPSPI_SR_TCF_MASK)); /* wait for the SPI to be done transmitting */
    EVE_cs_clear();
    EVE_dma_busy = 0;
    EVE_SPI->TCR &= ~LPSPI_TCR_RXMSK_MASK; /* enable LPSPI receive */
}

#endif /* DMA */

#endif /* S32K14x */

/* ################################################################## */
/* ################################################################## */

#if defined (GD32C103)

void DELAY_MS(uint16_t val)
{
    while (val > 0U)
    {
        for (uint16_t counter = 0; counter < EVE_DELAY_1MS; counter++)
        {
            __asm__ volatile ("nop");
        }
        val--;
    }
}

void EVE_init_spi(void)
{
    /* only two valid options, the SPI0 pins are either mapped to GPIOA (default), or GPIOB */
    if (EVE_SPI_PORT == GPIOA)
    {
        rcu_periph_clock_enable(RCU_GPIOA);
        gpio_init(GPIOA, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_5);
        gpio_init(GPIOA, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_7);
        gpio_init(GPIOA, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, GPIO_PIN_6);
    }
    else
    {
        rcu_periph_clock_enable(RCU_GPIOB);
        gpio_init(GPIOB, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_3);
        gpio_init(GPIOB, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_5);
        gpio_init(GPIOB, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, GPIO_PIN_4);
    }

    rcu_periph_clock_enable(RCU_AF);
    rcu_periph_clock_enable(RCU_SPI0);

    spi_parameter_struct spi_init_struct;
    spi_i2s_deinit(SPI0);
    spi_struct_para_init(&spi_init_struct);

    spi_init_struct.trans_mode           = SPI_TRANSMODE_FULLDUPLEX;
    spi_init_struct.device_mode          = SPI_MASTER;
    spi_init_struct.frame_size           = SPI_FRAMESIZE_8BIT;
    spi_init_struct.clock_polarity_phase = SPI_CK_PL_LOW_PH_1EDGE;
    spi_init_struct.nss                  = SPI_NSS_SOFT;
    spi_init_struct.prescale             = SPI_PSC_16; /* SPI_PSC_16 -> 120MHz / 16 = 7.5MHz */
    spi_init_struct.endian               = SPI_ENDIAN_MSB;
    spi_init(SPI0, &spi_init_struct);
    spi_enable(SPI0);
}

#if defined (EVE_DMA)

uint32_t EVE_dma_buffer[1025U];
volatile uint16_t EVE_dma_buffer_index = 0;
volatile uint8_t EVE_dma_busy = 0;

void EVE_init_dma(void)
{
    rcu_periph_clock_enable(RCU_DMA0);
    nvic_irq_enable(DMA0_Channel2_IRQn, 0, 0);
}

void EVE_start_dma_transfer(void)
{
    dma_parameter_struct dma_init_struct;

    dma_deinit(DMA0, DMA_CH2);
    DMA_CHCTL(DMA0, DMA_CH2) = DMA_CHCTL(DMA0, DMA_CH2) | DMA_CHXCTL_FTFIE; /* enable full transfer finish interrupt */

    dma_struct_para_init(&dma_init_struct);
    dma_init_struct.periph_addr  = (uint32_t)&SPI_DATA(SPI0);
    dma_init_struct.memory_addr  = ((uint32_t) &EVE_dma_buffer[0]) + 1U;
    dma_init_struct.direction    = DMA_MEMORY_TO_PERIPHERAL;
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
    dma_init_struct.priority     = DMA_PRIORITY_LOW;
    dma_init_struct.number       = (((EVE_dma_buffer_index) * 4U) - 1U);
    dma_init_struct.periph_inc   = DMA_PERIPH_INCREASE_DISABLE;
    dma_init_struct.memory_inc   = DMA_MEMORY_INCREASE_ENABLE;
    dma_init(DMA0, DMA_CH2, &dma_init_struct); /* configure SPI0 transmit dma: DMA0-DMA_CH2 */

    EVE_cs_set();

    dma_channel_enable(DMA0, DMA_CH2);
    spi_dma_enable(SPI0, SPI_DMA_TRANSMIT);
    EVE_dma_busy = 42;
}

void DMA0_Channel2_IRQHandler(void)
{
    if (dma_interrupt_flag_get(DMA0, DMA_CH2, DMA_FLAG_FTF))
    {
        dma_interrupt_flag_clear(DMA0, DMA_CH2, DMA_INT_FLAG_G);
        while (SPI_STAT(SPI0) & SPI_STAT_TRANS) {}
        EVE_cs_clear();
        EVE_dma_busy = 0;
    }
}

#endif /* DMA */
#endif /* GD32C103 */

#endif /* __GNUC__ */

/* ################################################################## */
/* ################################################################## */

#if defined (__TI_ARM__)

#if defined (__MSP432P401R__)

/* SPI Master Configuration Parameter */
const eUSCI_SPI_MasterConfig EVE_Config =
{
    EUSCI_B_SPI_CLOCKSOURCE_SMCLK,             // SMCLK Clock Source
    48000000,                                   // SMCLK  = 48MHZ
    500000,                                    // SPICLK = 1Mhz
    EUSCI_B_SPI_MSB_FIRST,                     // MSB First
    EUSCI_B_SPI_PHASE_DATA_CAPTURED_ONFIRST_CHANGED_ON_NEXT,    // Phase
    EUSCI_B_SPI_CLOCKPOLARITY_INACTIVITY_LOW, // High polarity
    EUSCI_B_SPI_3PIN                           // 3Wire SPI Mode
};

void EVE_SPI_Init(void)
{
    GPIO_setAsOutputPin(EVE_CS_PORT, EVE_CS);
    GPIO_setAsOutputPin(EVE_PDN_PORT, EVE_PDN);
//  GPIO_setAsInputPinWithPullDownResistor(EVE_INT_PORT,EVE_INT);

    GPIO_setOutputHighOnPin(EVE_CS_PORT, EVE_CS);
    GPIO_setOutputHighOnPin(EVE_PDN_PORT, EVE_PDN);

    GPIO_setAsPeripheralModuleFunctionInputPin(RIVERDI_PORT, RIVERDI_SIMO | RIVERDI_SOMI | RIVERDI_CLK, GPIO_PRIMARY_MODULE_FUNCTION);
    SPI_initMaster(EUSCI_B0_BASE, &EVE_Config);
    SPI_enableModule(EUSCI_B0_BASE);
}

#endif /* __MSP432P401R__ */
#endif /* __TI_ARM__ */

#if defined (LINUX_LIBGPIOD)

static struct gpiod_chip *gpio_chip = NULL;
struct gpiod_line *pd_n_line = NULL;
struct gpiod_line *cs_line = NULL;
spi_handle_t spi_fd = -1;

eve_init_spi_ret_code_t EVE_init_spi(void)
{
    spi_fd = open(EVE_SPI, O_RDWR);
    if (spi_fd < 0) {
        return EVE_INIT_SPI_OPEN_ERR;
    }
    uint8_t mode = EVE_SPI_MODE;
    int ret = ioctl(spi_fd, SPI_IOC_WR_MODE, &mode);
    if (ret < 0) {
        close(spi_fd);
        return EVE_INIT_SPI_SET_MODE_ERR;
    }

    uint8_t bits = EVE_SPI_BITS_PER_WORD;
    ret = ioctl(spi_fd, SPI_IOC_WR_BITS_PER_WORD, &bits);
    if (ret < 0) {
        close(spi_fd);
        return EVE_INIT_SPI_SET_BITS_PER_WORD_ERR;
    }

    uint32_t speed = EVE_SPI_SPEED;
    ret = ioctl(spi_fd, SPI_IOC_WR_MAX_SPEED_HZ, &speed);
    if (ret < 0) {
        close(spi_fd);
        return EVE_INIT_SPI_SET_MAX_SPEED_ERR;
    }

    return EVE_INIT_SPI_OK;
}

void EVE_deinit_spi(void)
{
    close(spi_fd);
}

eve_init_gpio_ret_code_t EVE_init_gpio(void)
{
    gpio_chip = gpiod_chip_open_by_name(EVE_GPIO_CHIP);
    if (!gpio_chip) {
        return EVE_INIT_GPIO_CHIP_ERR;
    }

    pd_n_line = gpiod_chip_get_line(gpio_chip, EVE_PDN);
    if (!pd_n_line) {
        gpiod_chip_close(gpio_chip);
        return -2;
        return EVE_INIT_GPIO_PDN_GET_LINE_ERR;
    }

    cs_line = gpiod_chip_get_line(gpio_chip, EVE_CS);
    if (!cs_line) {
        gpiod_line_release(pd_n_line);
        gpiod_chip_close(gpio_chip);
        return EVE_INIT_GPIO_CS_GET_LINE_ERR;
    }

    if (gpiod_line_request_output(pd_n_line, "EVE", 1) < 0) {
        gpiod_line_release(pd_n_line);
        gpiod_line_release(cs_line);
        gpiod_chip_close(gpio_chip);
        return EVE_INIT_GPIO_PDN_REQUEST_OUTPUT_ERR;
    }

    if (gpiod_line_request_output(cs_line, "EVE", 1) < 0) {
        gpiod_line_release(pd_n_line);
        gpiod_line_release(cs_line);
        gpiod_chip_close(gpio_chip);
        return EVE_INIT_GPIO_CS_REQUEST_OUTPUT_ERR;
    }

    return EVE_INIT_GPIO_OK;
}

void EVE_deinit_gpio(void)
{
    gpiod_line_release(pd_n_line);
    gpiod_line_release(cs_line);
    gpiod_chip_close(gpio_chip);
}

#endif /* LINUX_LIBGPIOD */

#endif
